In [90]:
import pandas as pd
import numpy as np

In [91]:
df = pd.read_csv('starwars.csv')

In [92]:
df

,name,height,mass,hair_color,skin_color,eye_color,birth_year,sex,gender,homeworld,species,films,vehicles,starships
0,Luke Skywalker,172.0,77.0,blond,fair,blue,19.0,male,masculine,Tatooine,Human,"The Empire Strikes Back, Revenge of the Sith, ...","Snowspeeder, Imperial Speeder Bike","X-wing, Imperial shuttle"
1,C-3PO,167.0,75.0,NaN,gold,yellow,112.0,none,masculine,Tatooine,Droid,"The Empire Strikes Back, Attack of the Clones,...",NaN,NaN
2,R2-D2,96.0,32.0,NaN,"white, blue",red,33.0,none,masculine,Naboo,Droid,"The Empire Strikes Back, Attack of the Clones,...",NaN,NaN
3,Darth Vader,202.0,136.0,none,white,yellow,41.9,male,masculine,Tatooine,Human,"The Empire Strikes Back, Revenge of the Sith, ...",NaN,TIE Advanced x1
4,Leia Organa,150.0,49.0,brown,light,brown,19.0,female,feminine,Alderaan,Human,"The Empire Strikes Back, Revenge of the Sith, ...",Imperial Speeder Bike,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
82,Rey,NaN,NaN,brown,light,hazel,NaN,female,feminine,NaN,Human,The Force Awakens,NaN,NaN
83,Poe Dameron,NaN,NaN,brown,light,brown,NaN,male,masculine,NaN,Human,The Force Awakens,NaN,T-70 X-wing fighter
84,BB8,NaN,NaN,none,none,black,NaN,none,masculine,NaN,Droid,The Force Awakens,NaN,NaN
85,Captain Phasma,NaN,NaN,unknown,unknown,unknown,NaN,NaN,NaN,NaN,NaN,The Force Awakens,NaN,NaN
86,Padmé Amidala,165.0,45.0,brown,light,brown,46.0,female,feminine,Naboo,Human,"Attack of the Clones, The Phantom Menace, Reve...",NaN,"H-type Nubian yacht, Naboo star skiff, Naboo f..."

In [93]:
48==48  # 48 is equal to 48

True

In [94]:
np.nan

nan

In [95]:
np.nan == np.nan  # np.nan is not equal to np.nan because np.nan is not a number. NaN means not a number and it is not equal to itself.

False

In [96]:
df.isnull() # this will return a boolean dataframe where True means that the value is null and False means that the value is not null. NaN is a null value.

,name,height,mass,hair_color,skin_color,eye_color,birth_year,sex,gender,homeworld,species,films,vehicles,starships
0,False,False,False,False,False,False,False,False,False,False,False,False,False,False
1,False,False,False,True,False,False,False,False,False,False,False,False,True,True
2,False,False,False,True,False,False,False,False,False,False,False,False,True,True
3,False,False,False,False,False,False,False,False,False,False,False,False,True,False
4,False,False,False,False,False,False,False,False,False,False,False,False,False,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
82,False,True,True,False,False,False,True,False,False,True,False,False,True,True
83,False,True,True,False,False,False,True,False,False,True,False,False,True,False
84,False,True,True,False,False,False,True,False,False,True,False,False,True,True
85,False,True,True,False,False,False,True,True,True,True,True,False,True,True
86,False,False,False,False,False,False,False,False,False,False,False,False,True,False

In [97]:
df.notnull() # this will return a boolean dataframe where True means that the value is not null and False means that the value is null. NaN is a null value.

,name,height,mass,hair_color,skin_color,eye_color,birth_year,sex,gender,homeworld,species,films,vehicles,starships
0,True,True,True,True,True,True,True,True,True,True,True,True,True,True
1,True,True,True,False,True,True,True,True,True,True,True,True,False,False
2,True,True,True,False,True,True,True,True,True,True,True,True,False,False
3,True,True,True,True,True,True,True,True,True,True,True,True,False,True
4,True,True,True,True,True,True,True,True,True,True,True,True,True,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
82,True,False,False,True,True,True,False,True,True,False,True,True,False,False
83,True,False,False,True,True,True,False,True,True,False,True,True,False,True
84,True,False,False,True,True,True,False,True,True,False,True,True,False,False
85,True,False,False,True,True,True,False,False,False,False,False,True,False,False
86,True,True,True,True,True,True,True,True,True,True,True,True,False,True

In [98]:
df.isna() # this will return a boolean dataframe where True means that the value is null and False means that the value is not null. NaN is a null value.

,name,height,mass,hair_color,skin_color,eye_color,birth_year,sex,gender,homeworld,species,films,vehicles,starships
0,False,False,False,False,False,False,False,False,False,False,False,False,False,False
1,False,False,False,True,False,False,False,False,False,False,False,False,True,True
2,False,False,False,True,False,False,False,False,False,False,False,False,True,True
3,False,False,False,False,False,False,False,False,False,False,False,False,True,False
4,False,False,False,False,False,False,False,False,False,False,False,False,False,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
82,False,True,True,False,False,False,True,False,False,True,False,False,True,True
83,False,True,True,False,False,False,True,False,False,True,False,False,True,False
84,False,True,True,False,False,False,True,False,False,True,False,False,True,True
85,False,True,True,False,False,False,True,True,True,True,True,False,True,True
86,False,False,False,False,False,False,False,False,False,False,False,False,True,False

In [99]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 87 entries, 0 to 86
Data columns (total 14 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   name        87 non-null     object
 1   height      81 non-null     float64
 2   mass        59 non-null     float64
 3   hair_color  82 non-null     object
 4   skin_color  87 non-null     object
 5   eye_color   87 non-null     object
 6   birth_year  43 non-null     float64
 7   sex         83 non-null     object
 8   gender      83 non-null     object
 9   homeworld   77 non-null     object
 10  species     83 non-null     object
 11  films       87 non-null     object
 12  vehicles    11 non-null     object
 13  starships   20 non-null     object
dtypes: float64(3), object(11)
memory usage: 9.6+ KB

In [100]:
df.isnull().sum() # this will return the number of null values in each column

name           0
height         6
mass          28
hair_color     5
skin_color     0
eye_color      0
birth_year    44
sex            4
gender         4
homeworld     10
species        4
films          0
vehicles      76
starships     67
dtype: int64

In [101]:
df.isnull().sum().sum() # this will return the total number of null values in the dataframe

248

In [102]:
df.shape

(87, 14)

In [103]:
missing_values_rate_row = df.isnull().sum() / df.shape[0] # this will return the percentage of null values in each column
missing_values_rate_row

name          0.000000
height        0.068966
mass          0.321839
hair_color    0.057471
skin_color    0.000000
eye_color     0.000000
birth_year    0.505747
sex           0.045977
gender        0.045977
homeworld     0.114943
species       0.045977
films         0.000000
vehicles      0.873563
starships     0.770115
dtype: float64

In [104]:
missing_values_rate = df.isna().sum().sum() / df.size # this will return the percentage of null values in the dataframe
missing_values_rate

0.20361247947454844

In [105]:
df[df["homeworld"].notnull()] # this will return the rows where the homeworld column is not null

,name,height,mass,hair_color,skin_color,eye_color,birth_year,sex,gender,homeworld,species,films,vehicles,starships
0,Luke Skywalker,172.0,77.0,blond,fair,blue,19.0,male,masculine,Tatooine,Human,"The Empire Strikes Back, Revenge of the Sith, ...","Snowspeeder, Imperial Speeder Bike","X-wing, Imperial shuttle"
1,C-3PO,167.0,75.0,NaN,gold,yellow,112.0,none,masculine,Tatooine,Droid,"The Empire Strikes Back, Attack of the Clones,...",NaN,NaN
2,R2-D2,96.0,32.0,NaN,"white, blue",red,33.0,none,masculine,Naboo,Droid,"The Empire Strikes Back, Attack of the Clones,...",NaN,NaN
3,Darth Vader,202.0,136.0,none,white,yellow,41.9,male,masculine,Tatooine,Human,"The Empire Strikes Back, Revenge of the Sith, ...",NaN,TIE Advanced x1
4,Leia Organa,150.0,49.0,brown,light,brown,19.0,female,feminine,Alderaan,Human,"The Empire Strikes Back, Revenge of the Sith, ...",Imperial Speeder Bike,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
77,Tarfful,234.0,136.0,brown,brown,blue,NaN,male,masculine,Kashyyyk,Wookiee,Revenge of the Sith,NaN,NaN
78,Raymus Antilles,188.0,79.0,brown,light,brown,NaN,male,masculine,Alderaan,Human,"Revenge of the Sith, A New Hope",NaN,NaN
79,Sly Moore,178.0,48.0,none,pale,white,NaN,NaN,NaN,Umbara,NaN,"Attack of the Clones, Revenge of the Sith",NaN,NaN
80,Tion Medon,206.0,80.0,none,grey,black,NaN,male,masculine,Utapau,Pau'an,Revenge of the Sith,NaN,NaN
86,Padmé Amidala,165.0,45.0,brown,light,brown,46.0,female,feminine,Naboo,Human,"Attack of the Clones, The Phantom Menace, Reve...",NaN,"H-type Nubian yacht, Naboo star skiff, Naboo f..."

In [106]:
df[df["homeworld"].isnull()] # this will return the rows where the homeworld column is null

,name,height,mass,hair_color,skin_color,eye_color,birth_year,sex,gender,homeworld,species,films,vehicles,starships
18,Yoda,66.0,17.0,white,green,brown,896.0,male,masculine,NaN,Yoda's species,"The Empire Strikes Back, Attack of the Clones,...",NaN,NaN
21,IG-88,200.0,140.0,none,metal,red,15.0,none,masculine,NaN,Droid,The Empire Strikes Back,NaN,NaN
27,Arvel Crynyd,NaN,NaN,brown,fair,brown,NaN,male,masculine,NaN,Human,Return of the Jedi,NaN,A-wing
30,Qui-Gon Jinn,193.0,89.0,brown,fair,blue,92.0,male,masculine,NaN,Human,The Phantom Menace,Tribubble bongo,NaN
72,R4-P17,96.0,NaN,none,"silver, red","red, blue",NaN,none,feminine,NaN,Droid,"Attack of the Clones, Revenge of the Sith",NaN,NaN
81,Finn,NaN,NaN,black,dark,dark,NaN,male,masculine,NaN,Human,The Force Awakens,NaN,NaN
82,Rey,NaN,NaN,brown,light,hazel,NaN,female,feminine,NaN,Human,The Force Awakens,NaN,NaN
83,Poe Dameron,NaN,NaN,brown,light,brown,NaN,male,masculine,NaN,Human,The Force Awakens,NaN,T-70 X-wing fighter
84,BB8,NaN,NaN,none,none,black,NaN,none,masculine,NaN,Droid,The Force Awakens,NaN,NaN
85,Captain Phasma,NaN,NaN,unknown,unknown,unknown,NaN,NaN,NaN,NaN,NaN,The Force Awakens,NaN,NaN

In [107]:
df.dropna() # this will drop all the rows where there is at least one null value

,name,height,mass,hair_color,skin_color,eye_color,birth_year,sex,gender,homeworld,species,films,vehicles,starships
0,Luke Skywalker,172.0,77.0,blond,fair,blue,19.0,male,masculine,Tatooine,Human,"The Empire Strikes Back, Revenge of the Sith, ...","Snowspeeder, Imperial Speeder Bike","X-wing, Imperial shuttle"
9,Obi-Wan Kenobi,182.0,77.0,"auburn, white",fair,blue-gray,57.0,male,masculine,Stewjon,Human,"The Empire Strikes Back, Attack of the Clones,...",Tribubble bongo,"Jedi starfighter, Trade Federation cruiser, Na..."
10,Anakin Skywalker,188.0,84.0,blond,fair,blue,41.9,male,masculine,Tatooine,Human,"Attack of the Clones, The Phantom Menace, Reve...","Zephyr-G swoop bike, XJ-6 airspeeder","Trade Federation cruiser, Jedi Interceptor, Na..."
12,Chewbacca,228.0,112.0,brown,unknown,blue,200.0,male,masculine,Kashyyyk,Wookiee,"The Empire Strikes Back, Revenge of the Sith, ...",AT-ST,"Millennium Falcon, Imperial shuttle"
16,Wedge Antilles,170.0,77.0,brown,fair,hazel,21.0,male,masculine,Corellia,Human,"The Empire Strikes Back, Return of the Jedi, A...",Snowspeeder,X-wing
41,Darth Maul,175.0,80.0,none,red,yellow,54.0,male,masculine,Dathomir,Zabrak,The Phantom Menace,Sith speeder,Scimitar

In [108]:
df.dropna(axis=1) # this will drop all the columns where there is at least one null value

,name,skin_color,eye_color,films
0,Luke Skywalker,fair,blue,"The Empire Strikes Back, Revenge of the Sith, ..."
1,C-3PO,gold,yellow,"The Empire Strikes Back, Attack of the Clones,..."
2,R2-D2,"white, blue",red,"The Empire Strikes Back, Attack of the Clones,..."
3,Darth Vader,white,yellow,"The Empire Strikes Back, Revenge of the Sith, ..."
4,Leia Organa,light,brown,"The Empire Strikes Back, Revenge of the Sith, ..."
...,...,...,...,...
82,Rey,light,hazel,The Force Awakens
83,Poe Dameron,light,brown,The Force Awakens
84,BB8,none,black,The Force Awakens
85,Captain Phasma,unknown,unknown,The Force Awakens
86,Padmé Amidala,light,brown,"Attack of the Clones, The Phantom Menace, Reve..."

In [109]:
df.dropna(thresh=10) # this will drop all the rows where there are less than 10 non-null values

,name,height,mass,hair_color,skin_color,eye_color,birth_year,sex,gender,homeworld,species,films,vehicles,starships
0,Luke Skywalker,172.0,77.0,blond,fair,blue,19.0,male,masculine,Tatooine,Human,"The Empire Strikes Back, Revenge of the Sith, ...","Snowspeeder, Imperial Speeder Bike","X-wing, Imperial shuttle"
1,C-3PO,167.0,75.0,NaN,gold,yellow,112.0,none,masculine,Tatooine,Droid,"The Empire Strikes Back, Attack of the Clones,...",NaN,NaN
2,R2-D2,96.0,32.0,NaN,"white, blue",red,33.0,none,masculine,Naboo,Droid,"The Empire Strikes Back, Attack of the Clones,...",NaN,NaN
3,Darth Vader,202.0,136.0,none,white,yellow,41.9,male,masculine,Tatooine,Human,"The Empire Strikes Back, Revenge of the Sith, ...",NaN,TIE Advanced x1
4,Leia Organa,150.0,49.0,brown,light,brown,19.0,female,feminine,Alderaan,Human,"The Empire Strikes Back, Revenge of the Sith, ...",Imperial Speeder Bike,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
76,Grievous,216.0,159.0,none,"brown, white","green, yellow",NaN,male,masculine,Kalee,Kaleesh,Revenge of the Sith,Tsmeu-6 personal wheel bike,Belbullab-22 starfighter
77,Tarfful,234.0,136.0,brown,brown,blue,NaN,male,masculine,Kashyyyk,Wookiee,Revenge of the Sith,NaN,NaN
78,Raymus Antilles,188.0,79.0,brown,light,brown,NaN,male,masculine,Alderaan,Human,"Revenge of the Sith, A New Hope",NaN,NaN
80,Tion Medon,206.0,80.0,none,grey,black,NaN,male,masculine,Utapau,Pau'an,Revenge of the Sith,NaN,NaN
86,Padmé Amidala,165.0,45.0,brown,light,brown,46.0,female,feminine,Naboo,Human,"Attack of the Clones, The Phantom Menace, Reve...",NaN,"H-type Nubian yacht, Naboo star skiff, Naboo f..."

In [110]:
df.dropna(subset=["hair_color"]) # this will drop all the rows where the hair_color column is null

,name,height,mass,hair_color,skin_color,eye_color,birth_year,sex,gender,homeworld,species,films,vehicles,starships
0,Luke Skywalker,172.0,77.0,blond,fair,blue,19.0,male,masculine,Tatooine,Human,"The Empire Strikes Back, Revenge of the Sith, ...","Snowspeeder, Imperial Speeder Bike","X-wing, Imperial shuttle"
3,Darth Vader,202.0,136.0,none,white,yellow,41.9,male,masculine,Tatooine,Human,"The Empire Strikes Back, Revenge of the Sith, ...",NaN,TIE Advanced x1
4,Leia Organa,150.0,49.0,brown,light,brown,19.0,female,feminine,Alderaan,Human,"The Empire Strikes Back, Revenge of the Sith, ...",Imperial Speeder Bike,NaN
5,Owen Lars,178.0,120.0,"brown, grey",light,blue,52.0,male,masculine,Tatooine,Human,"Attack of the Clones, Revenge of the Sith, A N...",NaN,NaN
6,Beru Whitesun lars,165.0,75.0,brown,light,blue,47.0,female,feminine,Tatooine,Human,"Attack of the Clones, Revenge of the Sith, A N...",NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
82,Rey,NaN,NaN,brown,light,hazel,NaN,female,feminine,NaN,Human,The Force Awakens,NaN,NaN
83,Poe Dameron,NaN,NaN,brown,light,brown,NaN,male,masculine,NaN,Human,The Force Awakens,NaN,T-70 X-wing fighter
84,BB8,NaN,NaN,none,none,black,NaN,none,masculine,NaN,Droid,The Force Awakens,NaN,NaN
85,Captain Phasma,NaN,NaN,unknown,unknown,unknown,NaN,NaN,NaN,NaN,NaN,The Force Awakens,NaN,NaN
86,Padmé Amidala,165.0,45.0,brown,light,brown,46.0,female,feminine,Naboo,Human,"Attack of the Clones, The Phantom Menace, Reve...",NaN,"H-type Nubian yacht, Naboo star skiff, Naboo f..."

Filling in missing data: fillna() method

In [111]:
df.fillna("none") # this will replace all the null values with none

,name,height,mass,hair_color,skin_color,eye_color,birth_year,sex,gender,homeworld,species,films,vehicles,starships
0,Luke Skywalker,172.0,77.0,blond,fair,blue,19.0,male,masculine,Tatooine,Human,"The Empire Strikes Back, Revenge of the Sith, ...","Snowspeeder, Imperial Speeder Bike","X-wing, Imperial shuttle"
1,C-3PO,167.0,75.0,none,gold,yellow,112.0,none,masculine,Tatooine,Droid,"The Empire Strikes Back, Attack of the Clones,...",none,none
2,R2-D2,96.0,32.0,none,"white, blue",red,33.0,none,masculine,Naboo,Droid,"The Empire Strikes Back, Attack of the Clones,...",none,none
3,Darth Vader,202.0,136.0,none,white,yellow,41.9,male,masculine,Tatooine,Human,"The Empire Strikes Back, Revenge of the Sith, ...",none,TIE Advanced x1
4,Leia Organa,150.0,49.0,brown,light,brown,19.0,female,feminine,Alderaan,Human,"The Empire Strikes Back, Revenge of the Sith, ...",Imperial Speeder Bike,none
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
82,Rey,none,none,brown,light,hazel,none,female,feminine,none,Human,The Force Awakens,none,none
83,Poe Dameron,none,none,brown,light,brown,none,male,masculine,none,Human,The Force Awakens,none,T-70 X-wing fighter
84,BB8,none,none,none,none,black,none,none,masculine,none,Droid,The Force Awakens,none,none
85,Captain Phasma,none,none,unknown,unknown,unknown,none,none,none,none,none,The Force Awakens,none,none
86,Padmé Amidala,165.0,45.0,brown,light,brown,46.0,female,feminine,Naboo,Human,"Attack of the Clones, The Phantom Menace, Reve...",none,"H-type Nubian yacht, Naboo star skiff, Naboo f..."

In [112]:
df["hair_color"].fillna("none") # this will replace all the null values in the hair_color column with none

0       blond
1        none
2        none
3        none
4       brown
       ...
82      brown
83      brown
84       none
85    unknown
86      brown
Name: hair_color, Length: 87, dtype: object

In [113]:
df["mass"].fillna(df["mass"].mean())  # this will replace all the null values in the mass column with the mean of the mass column

0      77.000000
1      75.000000
2      32.000000
3     136.000000
4      49.000000
         ...
82     97.311864
83     97.311864
84     97.311864
85     97.311864
86     45.000000
Name: mass, Length: 87, dtype: float64

In [114]:
df["height"].fillna(df["height"].median())  # this will replace all the null values in the mass column with the median of the mass column

0     172.0
1     167.0
2      96.0
3     202.0
4     150.0
      ...
82    180.0
83    180.0
84    180.0
85    180.0
86    165.0
Name: height, Length: 87, dtype: float64

Interpolation: interpolate() method means to fill in the missing values with the values in between the missing values

In [115]:
df_1 = df[['height', 'mass']].iloc[65:75]
df_1

    height   mass
65   183.0   79.0
66   168.0   55.0
67   198.0  102.0
68   229.0   88.0
69   213.0    NaN
70   167.0    NaN
71    79.0   15.0
72    96.0    NaN
73   193.0   48.0
74   191.0    NaN

In [116]:
df_1.interpolate() # interpolation means to fill in the missing values with the values in between the missing values. In this case, the missing value in the mass column is filled with the value in between the missing values in the mass column. The same goes for the height column.

    height        mass
65   183.0   79.000000
66   168.0   55.000000
67   198.0  102.000000
68   229.0   88.000000
69   213.0   63.666667
70   167.0   39.333333
71    79.0   15.000000
72    96.0   31.500000
73   193.0   48.000000
74   191.0   48.000000

In [117]:
df_1.interpolate(method="spline", order=2)

    height        mass
65   183.0   79.000000
66   168.0   55.000000
67   198.0  102.000000
68   229.0   88.000000
69   213.0   60.619890
70   167.0   29.228863
71    79.0   15.000000
72    96.0   21.221567
73   193.0   48.000000
74   191.0   95.298287

In [118]:
df_1.interpolate(method="spline", order=2, limit=1) # limit=1 means that only one missing value will be filled in

    height        mass
65   183.0   79.000000
66   168.0   55.000000
67   198.0  102.000000
68   229.0   88.000000
69   213.0   60.619890
70   167.0         NaN
71    79.0   15.000000
72    96.0   21.221567
73   193.0   48.000000
74   191.0   95.298287

In [119]:
df["mass"] = df["mass"].fillna(df.groupby("sex")["mass"].transform("mean")) # After grouping by gender, taking the average of the groups, she filled that group with the average of the mass values of those of that gender.
df

,name,height,mass,hair_color,skin_color,eye_color,birth_year,sex,gender,homeworld,species,films,vehicles,starships
0,Luke Skywalker,172.0,77.000000,blond,fair,blue,19.0,male,masculine,Tatooine,Human,"The Empire Strikes Back, Revenge of the Sith, ...","Snowspeeder, Imperial Speeder Bike","X-wing, Imperial shuttle"
1,C-3PO,167.0,75.000000,NaN,gold,yellow,112.0,none,masculine,Tatooine,Droid,"The Empire Strikes Back, Attack of the Clones,...",NaN,NaN
2,R2-D2,96.0,32.000000,NaN,"white, blue",red,33.0,none,masculine,Naboo,Droid,"The Empire Strikes Back, Attack of the Clones,...",NaN,NaN
3,Darth Vader,202.0,136.000000,none,white,yellow,41.9,male,masculine,Tatooine,Human,"The Empire Strikes Back, Revenge of the Sith, ...",NaN,TIE Advanced x1
4,Leia Organa,150.0,49.000000,brown,light,brown,19.0,female,feminine,Alderaan,Human,"The Empire Strikes Back, Revenge of the Sith, ...",Imperial Speeder Bike,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
82,Rey,NaN,54.688889,brown,light,hazel,NaN,female,feminine,NaN,Human,The Force Awakens,NaN,NaN
83,Poe Dameron,NaN,81.004545,brown,light,brown,NaN,male,masculine,NaN,Human,The Force Awakens,NaN,T-70 X-wing fighter
84,BB8,NaN,69.750000,none,none,black,NaN,none,masculine,NaN,Droid,The Force Awakens,NaN,NaN
85,Captain Phasma,NaN,NaN,unknown,unknown,unknown,NaN,NaN,NaN,NaN,NaN,The Force Awakens,NaN,NaN
86,Padmé Amidala,165.0,45.000000,brown,light,brown,46.0,female,feminine,Naboo,Human,"Attack of the Clones, The Phantom Menace, Reve...",NaN,"H-type Nubian yacht, Naboo star skiff, Naboo f..."

In [120]:
df[["name", "height", "sex", "species"]].iloc[78:88]

               name  height     sex species
78  Raymus Antilles   188.0    male   Human
79        Sly Moore   178.0     NaN     NaN
80       Tion Medon   206.0    male  Pau'an
81             Finn     NaN    male   Human
82              Rey     NaN  female   Human
83      Poe Dameron     NaN    male   Human
84              BB8     NaN    none   Droid
85   Captain Phasma     NaN     NaN     NaN
86    Padmé Amidala   165.0  female   Human

In [121]:
df["height"] = df["height"].fillna(df.groupby(["sex", "species"])["height"].transform("mean"))
df[["name", "height", "sex", "species"]].iloc[78:88]  # So we filled one column based on the values ​​in another column

               name      height     sex species
78  Raymus Antilles  188.000000    male   Human
79        Sly Moore  178.000000     NaN     NaN
80       Tion Medon  206.000000    male  Pau'an
81             Finn  182.347826    male   Human
82              Rey  160.250000  female   Human
83      Poe Dameron  182.347826    male   Human
84              BB8  131.200000    none   Droid
85   Captain Phasma         NaN     NaN     NaN
86    Padmé Amidala  165.000000  female   Human